app/views/guests/new.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]
---
    <%= form.label 'Select one of your hosted events' %>
    <%= form.collection_select(:event_id, @user.events.all, :id, :title, :prompt => true) %>