app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (start_date > '2020-04-30')
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @events = Event.all
    if session[:current_user_id].is_a? Integer
      @user = User.find(session[:current_user_id])
    else
      @user = User.first

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @event = User.find(session[:current_user_id]).events.build

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("title", "body", "created_at", "updated_at", "user_id", "start_date") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @event = User.find(session[:current_user_id]).events.build(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "start_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_date", "2020-09-03"], ["updated_at", "2020-04-30 22:44:45.691807"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event.destroy

INSERT INTO "guests" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 3], ["created_at", "2020-05-01 15:30:26.111517"], ["updated_at", "2020-05-01 15:30:26.111517"]]
---
  def assist
    @guest = Guest.new(guest_params)

    respond_to do |format|
      if @guest.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find(params[:id])