app/controllers/guests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def new
    @guest = Guest.new
    @user = User.find(session[:current_user_id])
    @users = User.all

INSERT INTO "guests" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["event_id", 4], ["created_at", "2020-05-01 16:47:14.852818"], ["updated_at", "2020-05-01 16:47:14.852818"]]
---
  def create
    @guest = Guest.new(guest_params)

    respond_to do |format|
      if @guest.save