app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Perez"], ["created_at", "2020-04-29 19:31:30.972711"], ["updated_at", "2020-04-29 19:31:30.972711"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "events".* FROM "events" INNER JOIN "guests" ON "events"."id" = "guests"."event_id" WHERE "guests"."user_id" = ? AND (start_date > '2020-05-01')  [["user_id", 1]]
---
  def show
    @upcoming_events = @user.events_as_guest.where('event_date > ?', Date.today).all